Script started on 2022-10-16 21:20:58-07:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="314" LINES="82"]
]0;mjlund32@MattTop: /mnt/c/users/rick/downloads/ecs36b/hw1[01;32mmjlund32@MattTop[00m:[01;34m/mnt/c/users/rick/downloads/ecs36b/hw1[00m$ make
make: 'wordle' is up to date.
]0;mjlund32@MattTop: /mnt/c/users/rick/downloads/ecs36b/hw1[01;32mmjlund32@MattTop[00m:[01;34m/mnt/c/users/rick/downloads/ecs36b/hw1[00m$ gdb wordle
[35;1m[35;1mGNU gdb [m[35;1m(Ubuntu 9.1-0ubuntu1) [m[35;1m9.1[m[35;1m
[m[mCopyright (C) 2020 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from [32mwordle[m...
(gdb) file wordle
Load new symbol table from "wordle"? (y or n) y
Reading symbols from [32mwordle[m...
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: new
Running game #2309
word	unused alphabet
====	===============
Guess 1: guide
____o	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
o____	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
o_#_o	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: etsay
Correct Letters: __a__
Incorrect Letters: guidhorncl

yeast
You win
[Inferior 1 (process 64) exited normally]
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: new
Running game #1184
word	unused alphabet
====	===============
Guess 1: guide
o_o__	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
_____	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
_oo__	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: gica
Correct Letters: _____
Incorrect Letters: udethornsly

gamic
o#o##	_b___f___jk____pq____vwx_z
Guess 5: magic
You win
[Inferior 1 (process 68) exited normally]
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: load 666
Running game #666
word	unused alphabet
====	===============
Guess 1: guide
____o	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
__#__	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
____#	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: eoy
Correct Letters: __o_y
Incorrect Letters: guidthrnscal

epoxy
You win
[Inferior 1 (process 69) exited normally]
(gdb) load 885
`system-supplied DSO at 0x7ffff7fce000' has disappeared; keeping its symbols.
You can't do that when your target is `exec'
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: load 885
Running game #885
word	unused alphabet
====	===============
Guess 1: guide
#__#_	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
__#__	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
____#	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: gdoy
Correct Letters: g_ody
Incorrect Letters: uiethrnscal

goody
You win
[Inferior 1 (process 70) exited normally]
(gdb) load
`system-supplied DSO at 0x7ffff7fce000' has disappeared; keeping its symbols.
You can't do that when your target is `exec'
(gdb) he[K[Krun
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: help
Wordle is a simple game:
Guess the 5 letter word within 100 tries
After every guess, hints are shown for each character.
They look like this:
  _ = Character not found at all
  # = Character found and position correct
  o = Character found but position wrong
Unused letters of the alphabet are shown next to the hint

The game prefers valid positions over invalid positions,
And it handles double letters properly.
Guessing "RATES" when the word is "TESTS" shows "__oo#"
Input: exit
[Inferior 1 (process 71) exited normally]
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: new
Running game #1142
word	unused alphabet
====	===============
Guess 1: guide
__oo_	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
_____	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
___o_	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: idl
Correct Letters: _____
Incorrect Letters: guethornscay

dilli
o#o_o	_b___f___jk_m__pq____vwx_z
Guess 5: lipid
##_##	_b___f___jk_m___q____vwx_z
Guess 6: livid
You win
[Inferior 1 (process 72) exited normally]
(gdb) run
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: load 2219
Running game #2219
word	unused alphabet
====	===============
Guess 1: guide
__o__	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
o_o__	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
_____	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: ito
Correct Letters: _____
Incorrect Letters: gudehrnscaly

impot
oo_o#	_b___f___jk_____q____vwx_z
Guess 5: motif
o#o#_	_b_______jk_____q____vwx_z
Guess 6: obiit
o__##	_________jk_____q____vwx_z
Guess 7: oobit
_#_##	_________jk_____q____vwx_z
Guess 8: pitot
_o_o#	_________jk_____q____vwx_z
Guess 9: pivot
_ooo#	_________jk_____q_____wx_z
Guess 10: timbo
oo#_o	_________jk_____q_____wx_z
Guess 11: topoi
o#__o	_________jk_____q_____wx_z
Guess 12: vomit
You win
[Inferior 1 (process 73) exited normally]
(gdb) load 1231[K[K[K[K[K[K[K[K[Krun
Starting program: /mnt/c/users/rick/downloads/ecs36b/hw1/wordle 
Reading cache...  [OK]
Main Menu
=========
NEW: start a new game.
LOAD <num>: load a specific game
HELP: More information
EXIT: End game
The game number must be in range of 1-2315
Input: load 1231
Running game #1231
word	unused alphabet
====	===============
Guess 1: guide
o_o__	abc__f_h_jklmnopqrst_vwxyz
Guess 2: thorn
oo___	abc__f___jklm__pq_s__vwxyz
Guess 3: scaly
_____	_b___f___jk_m__pq____vwx_z
Guess 4: 

Top secret computer knowledge:
Included Letters: gith
Correct Letters: _____
Incorrect Letters: udeornscaly

bight
_####	_____f___jk_m__pq____vwx_z
Guess 5: fight
_####	_________jk_m__pq____vwx_z
Guess 6: hight
_####	_________jk_m__pq____vwx_z
Guess 7: kight
_####	_________j__m__pq____vwx_z
Guess 8: might
You win
[Inferior 1 (process 74) exited normally]
(gdb) q
]0;mjlund32@MattTop: /mnt/c/users/rick/downloads/ecs36b/hw1[01;32mmjlund32@MattTop[00m:[01;34m/mnt/c/users/rick/downloads/ecs36b/hw1[00m$ exit
exit

Script done on 2022-10-16 21:26:26-07:00 [COMMAND_EXIT_CODE="0"]
